In [1]:
import numpy as np
import pandas as pd

In [3]:
data=np.arange(0,20).reshape(5,4)

In [4]:
#Data transform

In [8]:
df=pd.DataFrame(data,index=["ROW_1","ROW_2","ROW_3","ROW_4","ROW_5"],columns=["Col_1","Col_2","Col_3","Col_4"])

In [9]:
df

       Col_1  Col_2  Col_3  Col_4
ROW_1      0      1      2      3
ROW_2      4      5      6      7
ROW_3      8      9     10     11
ROW_4     12     13     14     15
ROW_5     16     17     18     19

In [14]:
df.sample(3)

       Col_1  Col_2  Col_3  Col_4
ROW_1      0      1      2      3
ROW_4     12     13     14     15
ROW_3      8      9     10     11

In [16]:
df.columns

Index(['Col_1', 'Col_2', 'Col_3', 'Col_4'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, ROW_1 to ROW_5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col_1   5 non-null      int32
 1   Col_2   5 non-null      int32
 2   Col_3   5 non-null      int32
 3   Col_4   5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [19]:
df.describe()#summary of those col which are numeric

           Col_1      Col_2      Col_3      Col_4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

# Indexing(row index, column index,row column index)

In [21]:
df[['Col_1','Col_2']]

       Col_1  Col_2
ROW_1      0      1
ROW_2      4      5
ROW_3      8      9
ROW_4     12     13
ROW_5     16     17

In [ ]:
#By using row index

In [25]:
df.loc[["ROW_1","ROW_3"]]

       Col_1  Col_2  Col_3  Col_4
ROW_1      0      1      2      3
ROW_3      8      9     10     11

In [27]:
df.loc[["ROW_1"]]

       Col_1  Col_2  Col_3  Col_4
ROW_1      0      1      2      3

In [36]:
df.loc[["ROW_1","ROW_2"],["Col_2","Col_3"]]

       Col_2  Col_3
ROW_1      1      2
ROW_2      5      6

In [43]:
df.iloc[1:4:2,0:3]

       Col_1  Col_2  Col_3
ROW_2      4      5      6
ROW_4     12     13     14

In [45]:
df1=df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],index=["Row1",
                                                      "Row2"],columns=["Column1",
                                                                             "Column2",
                                                                             "Column3",
                                                                             ])

In [46]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Row1 to Row2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  2 non-null      int64
 1   Column2  1 non-null      float64
 2   Column3  2 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 64.0+ bytes

In [47]:
df1.isnull().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [1]:
df1.Column2.unique()

NameError: name 'df1' is not defined